; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob49) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate9)
	(at pallet1 distributor0)
	(clear crate11)
	(at pallet2 distributor1)
	(clear crate6)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 486)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 400)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 19)
	(at crate1 distributor0)
	(on crate1 crate0)
	(= (weight crate1) 20)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 95)
	(at crate3 distributor1)
	(on crate3 crate2)
	(= (weight crate3) 9)
	(at crate4 distributor0)
	(on crate4 crate1)
	(= (weight crate4) 100)
	(at crate5 distributor1)
	(on crate5 crate3)
	(= (weight crate5) 15)
	(at crate6 distributor1)
	(on crate6 crate5)
	(= (weight crate6) 70)
	(at crate7 depot0)
	(on crate7 pallet0)
	(= (weight crate7) 67)
	(at crate8 distributor0)
	(on crate8 crate4)
	(= (weight crate8) 43)
	(at crate9 depot0)
	(on crate9 crate7)
	(= (weight crate9) 3)
	(at crate10 distributor0)
	(on crate10 crate8)
	(= (weight crate10) 59)
	(at crate11 distributor0)
	(on crate11 crate10)
	(= (weight crate11) 4)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate8)
		(on crate1 crate6)
		(on crate4 crate0)
		(on crate5 pallet1)
		(on crate6 crate11)
		(on crate7 crate9)
		(on crate8 crate5)
		(on crate9 pallet2)
		(on crate10 crate7)
		(on crate11 pallet0)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate6 crate5 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate5)
   added: (lifting hoist2 crate6) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 10
2. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 10
3. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 70
   goals met: 0 of 10
4. (lift hoist2 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate3)
   added: (lifting hoist2 crate5) (clear crate3)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 10
5. (load hoist2 crate5 truck0 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   changed: (current_load truck0) from 70 to 85
   goals met: 0 of 10
6. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 10
7. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 85 to 70
   goals met: 0 of 10
8. (lift hoist2 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   changed: (fuel-cost) from 22 to 23
   goals met: 0 of 10
9. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 23 to 33
   goals met: 0 of 10
10. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 70 to 79
   goals met: 0 of 10
11. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 33 to 43
   goals met: 0 of 10
12. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 43 to 53
   goals met: 0 of 10
13. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 53 to 54
   goals met: 0 of 10
14. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 79 to 174
   goals met: 0 of 10
15. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 54 to 64
   goals met: 0 of 10
16. (lift hoist0 crate9 crate7 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate7)
   added: (lifting hoist0 crate9) (clear crate7)
   changed: (fuel-cost) from 64 to 65
   goals met: 0 of 10
17. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 65 to 75
   goals met: 0 of 10
18. (load hoist0 crate9 truck0 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck0) (available hoist0)
   changed: (current_load truck0) from 174 to 177
   goals met: 0 of 10
19. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 75 to 85
   goals met: 0 of 10
20. (unload hoist2 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck0) from 177 to 174
   goals met: 0 of 10
21. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 85 to 95
   goals met: 0 of 10
22. (drop hoist2 crate9 pallet2 distributor1)
   deleted: (lifting hoist2 crate9) (clear pallet2)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 pallet2)
   goals met: 1 of 10
23. (lift hoist0 crate7 pallet0 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 pallet0)
   added: (lifting hoist0 crate7) (clear pallet0)
   changed: (fuel-cost) from 95 to 96
   goals met: 1 of 10
24. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 96 to 106
   goals met: 1 of 10
25. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 174 to 241
   goals met: 1 of 10
26. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 106 to 116
   goals met: 1 of 10
27. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 15
   goals met: 1 of 10
28. (unload hoist1 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 241 to 171
   goals met: 1 of 10
29. (drop hoist1 crate6 crate11 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate11)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate11)
   goals met: 2 of 10
30. (lift hoist1 crate6 crate11 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate11)
   added: (lifting hoist1 crate6) (clear crate11)
   changed: (fuel-cost) from 116 to 117
   goals met: 1 of 10
31. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 15 to 85
   goals met: 1 of 10
32. (lift hoist1 crate11 crate10 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist1) (on crate11 crate10)
   added: (lifting hoist1 crate11) (clear crate10)
   changed: (fuel-cost) from 117 to 118
   goals met: 1 of 10
33. (load hoist1 crate11 truck1 distributor0)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck1) (available hoist1)
   changed: (current_load truck1) from 85 to 89
   goals met: 1 of 10
34. (lift hoist1 crate10 crate8 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate8)
   added: (lifting hoist1 crate10) (clear crate8)
   changed: (fuel-cost) from 118 to 119
   goals met: 1 of 10
35. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   changed: (current_load truck0) from 171 to 230
   goals met: 1 of 10
36. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 119 to 129
   goals met: 1 of 10
37. (unload hoist2 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck0) from 230 to 163
   goals met: 1 of 10
38. (drop hoist2 crate7 crate9 distributor1)
   deleted: (lifting hoist2 crate7) (clear crate9)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 crate9)
   goals met: 2 of 10
39. (unload hoist2 crate10 truck0 distributor1)
   deleted: (in crate10 truck0) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck0) from 163 to 104
   goals met: 2 of 10
40. (drop hoist2 crate10 crate7 distributor1)
   deleted: (lifting hoist2 crate10) (clear crate7)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 crate7)
   goals met: 3 of 10
41. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 89 to 19
   goals met: 3 of 10
42. (drop hoist1 crate6 crate8 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate8)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate8)
   goals met: 3 of 10
43. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 19 to 4
   goals met: 3 of 10
44. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 129 to 139
   goals met: 3 of 10
45. (unload hoist0 crate11 truck1 depot0)
   deleted: (in crate11 truck1) (available hoist0)
   added: (lifting hoist0 crate11)
   changed: (current_load truck1) from 4 to 0
   goals met: 3 of 10
46. (drop hoist0 crate11 pallet0 depot0)
   deleted: (lifting hoist0 crate11) (clear pallet0)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 pallet0)
   goals met: 4 of 10
47. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 139 to 149
   goals met: 4 of 10
48. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 104 to 119
   goals met: 4 of 10
49. (lift hoist1 crate6 crate8 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate8)
   added: (lifting hoist1 crate6) (clear crate8)
   changed: (fuel-cost) from 149 to 150
   goals met: 4 of 10
50. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 119 to 189
   goals met: 4 of 10
51. (lift hoist1 crate8 crate4 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate4)
   added: (lifting hoist1 crate8) (clear crate4)
   changed: (fuel-cost) from 150 to 151
   goals met: 4 of 10
52. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 189 to 232
   goals met: 4 of 10
53. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 232 to 217
   goals met: 4 of 10
54. (drop hoist1 crate5 crate4 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate4)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate4)
   goals met: 4 of 10
55. (unload hoist1 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 217 to 174
   goals met: 4 of 10
56. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 151 to 161
   goals met: 4 of 10
57. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 174 to 104
   goals met: 4 of 10
58. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 161 to 171
   goals met: 4 of 10
59. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 104 to 147
   goals met: 4 of 10
60. (lift hoist1 crate5 crate4 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate4)
   added: (lifting hoist1 crate5) (clear crate4)
   changed: (fuel-cost) from 171 to 172
   goals met: 4 of 10
61. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 147 to 162
   goals met: 4 of 10
62. (lift hoist1 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate1)
   added: (lifting hoist1 crate4) (clear crate1)
   changed: (fuel-cost) from 172 to 173
   goals met: 4 of 10
63. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 162 to 262
   goals met: 4 of 10
64. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   changed: (fuel-cost) from 173 to 174
   goals met: 4 of 10
65. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 262 to 282
   goals met: 4 of 10
66. (drop hoist0 crate6 crate11 depot0)
   deleted: (lifting hoist0 crate6) (clear crate11)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate11)
   goals met: 5 of 10
67. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 282 to 182
   goals met: 5 of 10
68. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 174 to 184
   goals met: 5 of 10
69. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck0) from 182 to 162
   goals met: 5 of 10
70. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 184 to 194
   goals met: 5 of 10
71. (drop hoist0 crate1 crate6 depot0)
   deleted: (lifting hoist0 crate1) (clear crate6)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate6)
   goals met: 6 of 10
72. (drop hoist1 crate4 crate0 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate0)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate0)
   goals met: 7 of 10
73. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 162 to 147
   goals met: 7 of 10
74. (drop hoist1 crate5 crate4 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate4)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate4)
   goals met: 7 of 10
75. (lift hoist1 crate5 crate4 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate4)
   added: (lifting hoist1 crate5) (clear crate4)
   changed: (fuel-cost) from 194 to 195
   goals met: 7 of 10
76. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 147 to 162
   goals met: 7 of 10
77. (lift hoist1 crate4 crate0 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate0)
   added: (lifting hoist1 crate4) (clear crate0)
   changed: (fuel-cost) from 195 to 196
   goals met: 6 of 10
78. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 162 to 262
   goals met: 6 of 10
79. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 196 to 197
   goals met: 6 of 10
80. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 262 to 281
   goals met: 6 of 10
81. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 281 to 266
   goals met: 6 of 10
82. (drop hoist1 crate5 pallet1 distributor0)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 pallet1)
   goals met: 7 of 10
83. (unload hoist1 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 266 to 223
   goals met: 7 of 10
84. (drop hoist1 crate8 crate5 distributor0)
   deleted: (lifting hoist1 crate8) (clear crate5)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 crate5)
   goals met: 8 of 10
85. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 223 to 204
   goals met: 8 of 10
86. (drop hoist1 crate0 crate8 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate8)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate8)
   goals met: 9 of 10
87. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 204 to 104
   goals met: 9 of 10
88. (drop hoist1 crate4 crate0 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate0)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate0)
   goals met: 10 of 10
